<template>
  <div>
    <!-- Header -->
    <header class="ex-header bg-gray">
      <div class="container mx-auto px-4 sm:px-8 xl:max-w-6xl xl:px-4">
        <h1 class="xl:ml-24">
          개인정보처리 및 이용에관한 방침
        </h1>
      </div> <!-- end of container -->
    </header> <!-- end of ex-header -->
    <!-- end of header -->

    <!-- Basic -->
    <div class="ex-basic-1 py-12">
      <div class="container mx-auto px-4 sm:px-8 xl:max-w-5xl xl:px-12">
        <p class="mb-10">
          개인정보처리자인 '헛삯'(이하 처리자)은 '따봉도치봇'서비스(이하 서비스)를 제공함에 있어 『개인정보보호법』 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 이 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립, 공개합니다.
        </p>

        <!-- 1 -->
        <h3 class="mb-4">
          1. 개인정보의 처리목적
        </h3>
        <p class="mb-12">
          처리자는 다음 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않습니다.<br>
          - (서비스 이용자에게 수집하는 정보) 채팅내역/이용자의 디스코드 아이디 : 서비스 제공을 위한 데이터 수집<br>
          - (채널 운영자에게 수집하는 정보) 채널 관리용 토큰 : 서비스 제공을 위한 데이터 수집
        </p><!-- 1 -->

        <!-- 2 -->
        <h3 class="mb-4">
          2. 개인정보의 처리 및 보유 기간
        </h3>
        <p class="mb-12">
          처리자는 위 1조의  수집된 개인정보를 목적달성 후 지체없이 파기합니다.
        </p><!-- 2 -->

        <!-- 3 -->
        <h3 class="mb-4">
          3. 개인정보의 파기절차 및 파기방법
        </h3>
        <p class="mb-12">
          처리자는 수집 된 정보를 디지털 Database에 수집하며, 이 Database에 저장된 데이터를 삭제함으로써, 개인정보를 파기합니다.
        </p><!-- 3 -->

        <!-- 4 -->
        <h3 class="mb-4">
          4. 개인정보 수집거부에 관한 권리
        </h3>
        <p class="mb-12">
          개인정보 수집을 거부할 경우 서비스를 이용할 수 없습니다.<br>
          서비스의 처리자는 디스코드 서비스를 통해 서비스를 제공하므로, 정보주체별로 수집거부에 관한 사항을 정하기 불가하므로,<br>
          만약 정보의 주체가 해당 디스코드 채널의 운영자가 아닐 경우 해당 디스코드의 채널을 탈퇴함으로 써 수집거부권을 행사할 수 있습니다.
        </p><!-- 4 -->

        <!-- 5 -->
        <h3 class="mb-4">
          5. 정보주체와 법정대리인의 권리/의무 및 그 행사방법에 관한사항
        </h3>
        <p class="mb-12">
          처리자는 정보의 주체가 미성년자인지 알 수 없으며, 특정 주체를 선택하여 서비스를 제공할 수 없음으로,<br>
          법정대리인의 권리/의무행사는 디스코드 서비스를 제공하는 Discord, Inc를 통하여 행사하여야 합니다.
        </p><!-- 5 -->

        <!-- 6 -->
        <h3 class="mb-4">
          6. 개인정보 처리방침의 변경
        </h3>
        <p class="mb-12">
          처리자는 서비스의 운영을 위해 본 개인정보 처리방침을 변경할 경우 변경되기 30일전에 디스코드 채널을 통해 이를 고지하며, 이를 동의하지 않을 경우 본 방침의 4조 또는 5조의 방법을 통해 거부권을 행사할 수 있습니다.<br>
          약관시행일 까지 거부권을 행사하지 않은 경우 변경된 방침을 동의한것으로 간주합니다.
        </p><!-- 6 -->

        <!-- 7 -->
        <h3 class="mb-4">
          7. 개인정보 보호책임자
        </h3>
        <p class="mb-14">
          처리자는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.<br>
          ▶ 개인정보 보호책임자<br>
          - SNS명 : 디스코드<br>
          - 닉네임 : 헛삯#5433<br>

          - 연락처 : <a href="https://discord.gg/HgzAUdJKwR">https://discord.gg/HgzAUdJKwR</a><br>
          <br>
          정보주체꼐서는 처리자의 서비스를 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자에게 문의하실 수 있습니다.
        </p><!-- 7 -->
      </div>
    </div>
  </div>
</template>

<script>
// export default {
//   async asyncData ({ $http }) {
//     const test = await $http.$get('/api/test')
//     return {
//       test
//     }
//   }
// }
</script>

<style scoped>
</style>
